# Создайте функцию, принимающую на вход 3 числа и возвращающую наибольшее из них.

def max_int(nums):
    return max(nums)


numbers = [1, 2, 3]
print(max_int(numbers))
