# Используя цикл, запрашивайте у пользователя число, пока оно не станет больше 0, но меньше 10.
# После того, как пользователь введет корректное число, возведите его в степень 2 и выведите на экран.
# Например, пользователь вводит число 123, вы сообщаете ему, что число неверное, и говорите о диапазоне допустимых.
# И просите ввести заново.
# Допустим, пользователь ввел 2, оно подходит. Возводим его в степень 2 и выводим 4.

num = int(input('input num '))
while num < 0 or num > 10:
    print('invalid num. please enter num between 0 and 10')
    num = int(input('input num '))
else:
    print('valid num, result is', num ** 2)
